<a href="https://colab.research.google.com/github/werowe/HypatiaAcademy/blob/master/class/cars_2024_10_04.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%reload_ext sql

In [ ]:
%sql sqlite:///cars.db

In [ ]:
!ls

cars.db  sample_data

In [ ]:
%sql

 * sqlite:///cars.db

In [ ]:
%%sql
CREATE TABLE cars1
(
  Number INTEGER PRIMARY KEY AUTOINCREMENT,
  Car_Model TEXT,
  Brand TEXT,
  Horsepower TEXT,
  Production TEXT
);

 * sqlite:///cars.db
Done.

[]

In [ ]:
%%sql
INSERT INTO cars1 (Car_Model, Brand, Horsepower, Production)
VALUES ('Bel Air', 'Chevrolet', '283 hp', '1954–1957');

 * sqlite:///cars.db
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO cars1 (Car_Model, Brand, Horsepower, Production)
VALUES ('Corvette', 'Chevrolet', '150 hp', '1953–1962');

 * sqlite:///cars.db
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO cars1 (Car_Model, Brand, Horsepower, Production)
VALUES ('Eldorado', 'Cadillac', '210 hp', '1953');

 * sqlite:///cars.db
1 rows affected.

[]

In [ ]:
%%sql
select Car_Model, Brand from cars1;

 * sqlite:///cars.db
Done.

[('Bel Air', 'Chevrolet'), ('Corvette', 'Chevrolet'), ('Eldorado', 'Cadillac')]

In [ ]:
%%sql
select * from cars1

 * sqlite:///cars.db
Done.

[(1, 'Bel Air', 'Chevrolet', '283 hp', '1954–1957'),
 (2, 'Corvette', 'Chevrolet', '150 hp', '1953–1962'),
 (3, 'Eldorado', 'Cadillac', '210 hp', '1953')]

In [ ]:
%%sql
select * from cars1 where Car_Model = 'Bel Air'

 * sqlite:///cars.db
Done.

[(1, 'Bel Air', 'Chevrolet', '283 hp', '1954–1957')]

In [ ]:

import sqlite3

conn = sqlite3.connect("cars.db")
cursor = conn.cursor()
sql="select * from cars1";

cursor.execute(sql)

In [ ]:
rows = cursor.fetchall()

In [ ]:
for row in rows:
  print(row)

(1, 'Bel Air', 'Chevrolet', '283 hp', '1954–1957')
(2, 'Corvette', 'Chevrolet', '150 hp', '1953–1962')
(3, 'Eldorado', 'Cadillac', '210 hp', '1953')

In [ ]:
a=('Bel Air', 'Chevrolet', '283 hp', '1954–1957')
a[0], a[3]

('Bel Air', '1954–1957')

In [ ]:
for row in rows:
  print(row[1], " car number is ", row[0])

Bel Air  car number is  1
Corvette  car number is  2
Eldorado  car number is  3

In [ ]:
%%sql

delete from cars1;

 * sqlite:///cars.db
3 rows affected.

[]

In [ ]:
%%sql

UPDATE cars1
SET Car_Model = "Chieftain", Brand = "Pontiac", Horsepower = "118 hp", Production = "1949—1958"
WHERE Brand = "Cadillac";

 * sqlite:///cars.db
0 rows affected.

[]

In [ ]:
%%sql
select * from cars1

 * sqlite:///cars.db
Done.

[]

In [ ]:
%%sql

drop table cars1

 * sqlite:///cars.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE repairs
(
  repair_number INTEGER PRIMARY KEY AUTOINCREMENT,
  car_number TEXT,
  description TEXT,
  fee real
);

 * sqlite:///cars.db
Done.

[]

In [ ]:
%%sql

insert into repairs(car_number, description, fee)
values(2, "fix brakes", 432.23);
insert into repairs(car_number, description, fee)
values(1, "fix window", 25);
insert into repairs(car_number, description, fee)
values(2, "change oil", 23);

 * sqlite:///cars.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql

select * from repairs;

 * sqlite:///cars.db
Done.

[(1, '2', 'fix brakes', 432.23),
 (2, '2', 'fix brakes', 432.23),
 (3, '1', 'fix window', 25.0),
 (4, '2', 'change oil', 23.0)]